[
	{      
      "name": "Portfolio website built with modern web technologies",
	  "techs": ["React.js", "Next.js", "Express.js", "MongoDB", "Node.js", "JavaScript", "AWS EC2"], 
	  "summary": "A personal portfolio website built with both frontend and backend modern web technologies",
      "desc":"Although a personal portfolio website can be easily built as a static web page by only using HTML, CSS, and JavaScript, this website is built with frontend and backend modern web technologies. The main purpose of this project was to review what I learned about web technologies from Camosun College.",
      "imageUrls":["portfolio_about.PNG", "portfolio_education.PNG", "portfolio_skills.PNG", "portfolio_projects.PNG", "portfolio_contact.PNG"],
	  "links":[{"linkName":"Frontend repo", "linkUrl":"https://github.com/junghanhan/intro-frontend"}, {"linkName":"Backend repo", "linkUrl":"https://github.com/junghanhan/intro-backend"}]
    },
    {      
      "name": "Forest Cover Map Image Segmentation Tool",
	  "techs": ["Python", "Deep learning", "GIS", "Vector graphics"], 
	  "summary": "A software tool that is able to take data from a scanned, historical, hand-drawn forest cover map and convert it to analysis-ready data that can be used for analysis of forests in Canada such as forest growth modeling and simulation",
      "desc":"Historical maps can be a useful source of knowledge. They can provide information for analyzing geographic attributes for a specific time period. However, the scanned hand-written historical maps are raster images which are difficult to use for analysis. In this project, I implemented a software that takes the scanned hand-written historical maps and transforms them into a vector file format called 'Shapefile', which are analysis-ready forms of the maps.",
      "imageUrls":["FMS_tool.PNG","original_map.png","processed_map.png","keras-ocr.png"],
	  "links":[{"linkName":"Project repo", "linkUrl":"https://github.com/junghanhan/forest-map-segmentation"}]
    },
    {      
      "name": "The Cup Emporium: E-Commerce website",
	  "techs": ["JavaScript", "PHP", "MySQL", "Stripe"], 
	  "summary": "E-Commerce website for local business selling hand made ceramic cups and seeking to open distribution to North American market.",
      "desc":"E-Commerce website for local business selling hand made ceramic cups and seeking to open distribution to North American market. This is a group project of ICS-199 course at Camosun College. The goal of the project is to design and implement a cup selling website with landing page, order history page, shopping cart page, user account management and Stripe payment processing.",
      "imageUrls":["cup_emporium_landing_page.PNG","cup_emporium_catalogue.PNG","cup_emporium_shopping_cart.PNG","cup_emporium_checkout.PNG"],
	  "links":[{"linkName":"Project repo", "linkUrl":"https://github.com/junghanhan/cup-emporium"}]
    },
    {      
      "name": "IEEE 802.11 (WiFi networking protocol) Non-intrusive throughput estimator",
	  "techs": ["C", "C++", "Linux kernel wireless driver", "Packet sniffing"],
	  "summary": "A research paper proposing a practical scheme for estimating the available throughput of IEEE 802.11 (WiFi networking protocol) link",
      "desc":"Knowing the available throughput of an IEEE 802.11 (WiFi networking protocol) link before establishing the connection is beneficial. One usage of such information is the selection of an Access Point (AP) that provides the highest throughput to a user station. In this paper, I proposed a scheme that estimates the expected throughput of an 802.11 device in a non-intrusive manner. The proposed scheme does not require any aid from the infrastructure (e.g., AP, router) or other user stations. It does not generate any additional traffic overhead (e.g., probe traffic). The scheme relies solely on passive sniffing of the on-going traffic for short duration (i.e., less than the typical 802.11 beacon interval). The scheme works with various 802.11 technologies including 802.11n with frame aggregation and it works even in the situation when it is not possible to sniff complete traffic trace. The scheme is not affected by the 802.11 security mechanisms, because the scheme only needs information from the un-encrypted header part of 802.11 frames. The proposed scheme can be implemented practically in any system and its resource overhead is very low. The scheme is implemented on a Linux-based notebook and an Android-based smart phone. Experimental evaluation shows that the scheme accurately estimates the expected throughput in various settings.",
      "imageUrls":["thp_est_algorithm.PNG", "thp_est_result.PNG", "thp_est_active_sta_est.PNG", "thp_est_testbed.PNG"],
	  "links":[{"linkName":"Paper link", "linkUrl":"https://doi.org/10.1016/j.comnet.2018.07.023"}]
    },
    {      
      "name": "Acknowledgement Corruption: A New Aspect of Physical Layer Capture in IEEE 802.11 (WiFi networking protocol) Networks",
	  "techs": ["C", "C++", "Linux kernel wireless driver", "Packet sniffing"],
	  "summary": "A research paper identifying the characteristic of AC(Acknowledgement Corruption) in IEEE 802.11 (WiFi networking protocol) Networks via extensive experiments and simulations",
      "desc":"Even if a packet collision occurs in IEEE 802.11(WiFi) network, a transmission may be successfully decoded at the receiver if the signal strength of one transmission is sufficiently stronger than the other transmission. This phenomenon is called \"Physical Layer Capture\" (PLC). While existing works have considered PLC between data frames, in this paper we investigated the case that an ACK frame collides with the unfinished transmission of other data frames after the occurrence of PLC between data frames. As a result of this collision, the ACK frame may be corrupted, and the corresponding data frame needs to be retransmitted. We call this phenomenon \"ACK Corruption\" (AC). We identified the characteristics of AC via extensive experiments and simulations. Our study reveals that AC can occur in all IEEE 802.11 variants and its chance is dependent upon the relative signal strength between the stations and the MCS setting used. Further, we devised a way to avoid AC occurrence and evaluate its effectiveness.",
      "imageUrls":["ack_corruption.PNG"],
	  "links":[{"linkName":"Paper link", "linkUrl":"https://doi.org/10.1155/2018/3096710"}]
    },
    {      
      "name": "Hidden terminal aware IEEE 802.11ah AP selection",
	  "techs": ["C++", "NS-3"],
	  "summary": "A research paper proposing an approach to avoid the high collision rate at the phase of the AP(Access Point) selection for IEEE 802.11ah (One of WiFi networking protocols) networks",
      "desc":"Connectivity provisioning in large-scale Internet-of-Things (IoT) networks raises several challenges, one of which is the high collision rate among the transmission attempts of IoT devices. Transmission collisions result in prolonged data delivery delay and increased energy consumption of IoT devices. Contention-based wireless communication technologies such as WiFi is particularly vulnerable to this issue. As a remedy, a new standard IEEE 802.11ah is designed and such methods as RAW (Restricted Access Window) grouping is incorporated in order to curb the high collision rate. Meanwhile, in IEEE 802.11ah the transmission range and the number of devices that can be accommodated are also drastically increased. As a result, the impact of the hidden terminal problem is significantly amplified, which causes transmission collisions. In this paper, we proposed an approach to avoid the high collision rate at the phase of the AP(Access Point) selection for IEEE 802.11ah networks. The proposed scheme considers the traffic load balancing and the hidden terminal issue simultaneously, without incurring any burden to the IoT devices. No modification of the IEEE 802.11ah standard is needed. Via extensive NS-3 simulations, we have verified that the proposed AP selection scheme outperforms the existing schemes in terms of data delivery delay and energy consumption by reducing transmission collisions.",
      "imageUrls":["hidden_aware_ap_selection_algorithm.PNG", "hidden_aware_ap_selection_result1.PNG", "hidden_aware_ap_selection_result2.PNG", "80211ah.PNG"],
	  "links":[{"linkName":"Paper link", "linkUrl":"https://doi.org/10.1016/j.comcom.2021.02.024"}]	  
    }
 ]
